app/views/users/index.html.erb

SELECT "users".* FROM "users" WHERE (name LIKE '%f1rstplay3r%')  ORDER BY created_at DESC
---
<!-- <%= @all = User.all %>