app/controllers/home_controller.rb

SELECT "items".* FROM "items"
---
  def new
  	@items = Item.all