app/controllers/steampull_controller.rb

UPDATE "users" SET "steam_id" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
	def update
		@user = current_user
		@user.steam_id = params[:id_update][:steam_id]
		if @user.save