app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
    if logged_in?
      @myprofile = (@user.id == current_user.id)
    else
      @myprofile = false
    end

      inv_ids = Inventory.where(user_id: @user.id).pluck(:item_id)
      wish_ids = Wishlist.where(user_id: @user.id).pluck(:item_id)

      @games = Item.where(id: inv_ids).paginate(:page => params[:games_page], :per_page => 9)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" IN (SELECT "inventories"."id" FROM "inventories" WHERE "inventories"."user_id" = ?)  [["user_id", 2]]

	def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "steam_id", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    if User.find(params[:id]).id != current_user.id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]