app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (name LIKE '%f1rstplay3r%')  ORDER BY created_at DESC