app/controllers/wishlist_controller.rb

  def new
  	@items = Item.all
---
SELECT "items".* FROM "items"

  def create
  	if !logged_in?
  		flash[ :error]= "please login"
  		redirect_to login_url
  	else
	  	item_ids = params[ :items_ids]
	  	user = current_user

	  	for item in item_ids
	  		n = Wishlist.new(:user_id => current_user.id, :item_id => item)
	  		n.save
---
INSERT INTO "wishlists" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["item_id", 6], ["created_at", "2016-05-05 02:12:54.744574"], ["updated_at", "2016-05-05 02:12:54.744574"]]